In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'Col1':[1,2,3,4],
                  'Col2':[444,555,666,444],
                  'Col3':['abc','def','ghi','xyz']})
df.head()

   Col1  Col2 Col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df['Col2'].unique()

array([444, 555, 666], dtype=int64)

In [4]:
len(df['Col2'].unique())

3

In [5]:
df['Col2'].nunique()

3

In [6]:
df['Col2'].value_counts()

444    2
555    1
666    1
Name: Col2, dtype: int64

In [8]:
df[df['Col1']>2]

   Col1  Col2 Col3
2     3   666  ghi
3     4   444  xyz

In [9]:
df['Col1']>2

0    False
1    False
2     True
3     True
Name: Col1, dtype: bool

In [11]:
df[(df['Col1']>2) & (df['Col2']==4444)]

Empty DataFrame
Columns: [Col1, Col2, Col3]
Index: []

In [15]:
def times2(x):
    return x*2

In [16]:
df['Col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: Col1, dtype: int64

In [17]:
df['Col3'].apply(len)

0    3
1    3
2    3
3    3
Name: Col3, dtype: int64

In [19]:
df.columns

Index(['Col1', 'Col2', 'Col3'], dtype='object')

In [20]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [22]:
df.sort_values('Col2')

   Col1  Col2 Col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [23]:
df.isnull()

    Col1   Col2   Col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [24]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
                  'B':['one','one','two','two','one','one'],
                  'C':['x','y','x','y','x','y'],
                   'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [25]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [26]:
df.pivot_table(values ='D', index =['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN